lsr-components/src/main/resources/wsdl/LOV2.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<wsse:Username>QMOFK026203F3VBQB8MLO8MJ3:guest:FO</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">guest</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</S:Header>
	<S:Body>
		<ns2:create xmlns:ns2="http://ws.mrted.com/">
			<ns2:searchAgentDto>
				<deliveryFrequency>ONCE_A_DAY</deliveryFrequency>
				<email>youssef.benajiba@gmail.com</email>
				<expirationDate>2018-05-06T01:20:54.967+02:00</expirationDate>
				<searchCriteria>
					<contractTypes>
						<contractType>1106</contractType>
					</contractTypes>
					<organizationIds>
						<organizationId>1</organizationId>
						<organizationId>4</organizationId>
						<organizationId>758</organizationId>
						<organizationId>811</organizationId>
						<organizationId>756</organizationId>
						<organizationId>812</organizationId>
						<organizationId>757</organizationId>
					</organizationIds>
				</searchCriteria>
			</ns2:searchAgentDto>
			<ns2:sendEmail>true</ns2:sendEmail>
			<ns2:language>FR</ns2:language>
		</ns2:create>
	</S:Body>
</S:Envelope>